data/Section 5/5.1/Clients/VM1_Instance2/rep1/output_C2_T1_W64_K6_R1.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  90 secs]  0 threads:       40402 ops,     502 (avg:     448) ops/sec, 1.79MB/sec (avg: 1.60MB/sec),  3.97 (avg:  4.44) msec latency

1         Threads
2         Connections per thread
90        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets         224.46          ---          ---      4.24300       233.10
Gets         224.44      1346.65         0.00      4.63700      1401.16
Waits          0.00          ---          ---      0.00000          ---
Totals       448.91      1346.65         0.00      4.44000      1634.26


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.500         0.00
SET       1.600         0.13
SET       1.700         0.50
SET       1.800         1.38
SET       1.900         3.03
SET       2.000         5.43
SET       2.100         8.51
SET       2.200        12.26
SET       2.300        16.48
SET       2.400        20.74
SET       2.500        24.83
SET       2.600        28.61
SET       2.700        32.20
SET       2.800        35.16
SET       2.900        38.16
SET       3.000        40.75
SET       3.100        43.12
SET       3.200        45.21
SET       3.300        47.14
SET       3.400        49.01
SET       3.500        50.65
SET       3.600        52.28
SET       3.700        53.74
SET       3.800        55.18
SET       3.900        56.65
SET       4.000        58.09
SET       4.100        59.44
SET       4.200        60.75
SET       4.300        62.09
SET       4.400        63.46
SET       4.500        64.80
SET       4.600        66.17
SET       4.700        67.37
SET       4.800        68.70
SET       4.900        69.86
SET       5.000        71.02
SET       5.100        72.21
SET       5.200        73.35
SET       5.300        74.52
SET       5.400        75.71
SET       5.500        76.88
SET       5.600        78.03
SET       5.700        79.19
SET       5.800        80.51
SET       5.900        81.76
SET       6.000        82.89
SET       6.100        84.01
SET       6.200        85.10
SET       6.300        86.11
SET       6.400        87.07
SET       6.500        87.99
SET       6.600        88.70
SET       6.700        89.35
SET       6.800        90.02
SET       6.900        90.65
SET       7.000        91.20
SET       7.100        91.67
SET       7.200        92.10
SET       7.300        92.54
SET       7.400        92.92
SET       7.500        93.28
SET       7.600        93.59
SET       7.700        93.83
SET       7.800        94.06
SET       7.900        94.29
SET       8.000        94.57
SET       8.100        94.79
SET       8.200        95.02
SET       8.300        95.24
SET       8.400        95.41
SET       8.500        95.59
SET       8.600        95.76
SET       8.700        96.00
SET       8.800        96.18
SET       8.900        96.38
SET       9.000        96.48
SET       9.100        96.61
SET       9.200        96.75
SET       9.300        96.93
SET       9.400        97.03
SET       9.500        97.14
SET       9.600        97.27
SET       9.700        97.42
SET       9.800        97.50
SET       9.900        97.64
SET      10.000        98.07
SET      11.000        98.71
SET      12.000        99.05
SET      13.000        99.23
SET      14.000        99.35
SET      15.000        99.48
SET      16.000        99.56
SET      17.000        99.62
SET      18.000        99.69
SET      19.000        99.77
SET      20.000        99.82
SET      21.000        99.85
SET      22.000        99.87
SET      23.000        99.89
SET      24.000        99.92
SET      28.000        99.93
SET      30.000        99.95
SET      35.000        99.97
SET      43.000        99.97
SET      49.000        99.98
SET      51.000        99.98
SET      58.000        99.99
SET      72.000       100.00
SET      75.000       100.00
---
GET       1.700         0.00
GET       1.800         0.01
GET       1.900         0.05
GET       2.000         0.31
GET       2.100         0.93
GET       2.200         2.19
GET       2.300         4.12
GET       2.400         6.89
GET       2.500        10.05
GET       2.600        14.23
GET       2.700        18.16
GET       2.800        22.39
GET       2.900        26.43
GET       3.000        30.31
GET       3.100        33.73
GET       3.200        36.84
GET       3.300        39.67
GET       3.400        42.16
GET       3.500        44.46
GET       3.600        46.50
GET       3.700        48.33
GET       3.800        50.00
GET       3.900        51.51
GET       4.000        52.95
GET       4.100        54.25
GET       4.200        55.50
GET       4.300        56.77
GET       4.400        58.00
GET       4.500        59.32
GET       4.600        60.48
GET       4.700        61.67
GET       4.800        62.92
GET       4.900        64.33
GET       5.000        65.54
GET       5.100        66.75
GET       5.200        68.03
GET       5.300        69.43
GET       5.400        70.68
GET       5.500        72.02
GET       5.600        73.39
GET       5.700        74.75
GET       5.800        76.00
GET       5.900        77.26
GET       6.000        78.58
GET       6.100        79.88
GET       6.200        81.09
GET       6.300        82.35
GET       6.400        83.56
GET       6.500        84.61
GET       6.600        85.57
GET       6.700        86.65
GET       6.800        87.46
GET       6.900        88.41
GET       7.000        89.28
GET       7.100        90.03
GET       7.200        90.48
GET       7.300        90.94
GET       7.400        91.47
GET       7.500        91.89
GET       7.600        92.38
GET       7.700        92.70
GET       7.800        93.06
GET       7.900        93.30
GET       8.000        93.60
GET       8.100        93.93
GET       8.200        94.24
GET       8.300        94.51
GET       8.400        94.73
GET       8.500        95.00
GET       8.600        95.25
GET       8.700        95.44
GET       8.800        95.59
GET       8.900        95.71
GET       9.000        95.91
GET       9.100        96.04
GET       9.200        96.16
GET       9.300        96.32
GET       9.400        96.46
GET       9.500        96.58
GET       9.600        96.72
GET       9.700        96.83
GET       9.800        96.98
GET       9.900        97.11
GET      10.000        97.63
GET      11.000        98.24
GET      12.000        98.69
GET      13.000        98.98
GET      14.000        99.13
GET      15.000        99.32
GET      16.000        99.46
GET      17.000        99.56
GET      18.000        99.62
GET      19.000        99.69
GET      20.000        99.72
GET      21.000        99.76
GET      22.000        99.80
GET      23.000        99.81
GET      24.000        99.84
GET      25.000        99.85
GET      26.000        99.85
GET      27.000        99.87
GET      28.000        99.89
GET      29.000        99.90
GET      30.000        99.91
GET      31.000        99.91
GET      33.000        99.92
GET      34.000        99.92
GET      35.000        99.93
GET      36.000        99.94
GET      41.000        99.95
GET      42.000        99.95
GET      44.000        99.96
GET      51.000        99.96
GET      52.000        99.97
GET      57.000        99.97
GET      64.000        99.98
GET      65.000        99.98
GET      71.000        99.99
GET      72.000        99.99
GET      88.000       100.00
GET      92.000       100.00
---